In [1]:
USE TSQLV4;
SET NOCOUNT ON

CREATE TABLE ##tmp1
(
    Rcd_Id INT IDENTITY(1, 1) NOT NULL,
    employee_id INT,
    first_name VARCHAR(25),
    last_name VARCHAR(25),
    dept_id VARCHAR(25),
    manager_id INT,
    salary INT,
    expertise VARCHAR(25),
    PRIMARY KEY (Rcd_Id)
)

INSERT INTO ##tmp1
VALUES
(100, 'John', 'White', 'IT', 103, 120000, 'Senior')
INSERT INTO ##tmp1
VALUES
(101, 'Mary', 'Danner', 'Account', 109, 80000, 'junior')
INSERT INTO ##tmp1
VALUES
(102, 'Ann', 'Lynn', 'Sales', 107, 140000, 'Semisenior')
INSERT INTO ##tmp1
VALUES
(103, 'Peter', 'O''connor', 'IT', 110, 130000, 'Senior')
INSERT INTO ##tmp1
VALUES
(106, 'Sue', 'Sanchez', 'Sales', 107, 110000, 'Junior')
INSERT INTO ##tmp1
VALUES
(107, 'Marta', 'Doe', 'Sales', 110, 180000, 'Senior')
INSERT INTO ##tmp1
VALUES
(109, 'Ann', 'Danner', 'Account', 110, 90000, 'Senior')
INSERT INTO ##tmp1
(
    employee_id,
    first_name,
    last_name,
    dept_id,
    salary,
    expertise
)
VALUES
(110, 'Simon', 'Yang', 'CEO', 250000, 'Senior')
INSERT INTO ##tmp1
VALUES
(111, 'Juan', 'Graue', 'Sales', 102, 37000, 'Junior')

-- Select * from #tmp1

--drop table ##tmp1

- ROW\_NUMBER()/RANK()/DENSE\_RANK()区别

    - ROW\_NUMBER()：排序，不会有重复的排序数值。对于相等的两个数字，排序序号不一致
    - DENSE\_RANK()：排序，可有重复值。对于相等的两个数字，排序序号一致
    - RANK()：排序，可有重复值。对于相等的两个数字，排序序号一致，但是总数会减少

In [18]:
SELECT employee_id,
       last_name,
       first_name,
       salary,
       RANK() OVER (ORDER BY salary DESC) AS ranking
FROM ##tmp1

employee_id,last_name,first_name,salary,ranking
110,Yang,Simon,250000,1
107,Doe,Marta,180000,2
102,Lynn,Ann,140000,3
103,O'connor,Peter,130000,4
100,White,John,120000,5
106,Sanchez,Sue,110000,6
109,Danner,Ann,90000,7
101,Danner,Mary,80000,8
111,Graue,Juan,37000,9

In [20]:
WITH employee_ranking
AS (SELECT employee_id,
           last_name,
           first_name,
           salary,
           RANK() OVER (ORDER BY salary DESC) AS ranking
    FROM ##tmp1)
SELECT employee_id,
       last_name,
       first_name,
       salary
FROM employee_ranking
WHERE ranking <= 5
ORDER BY ranking

employee_id,last_name,first_name,salary
110,Yang,Simon,250000
107,Doe,Marta,180000
102,Lynn,Ann,140000
103,O'connor,Peter,130000
100,White,John,120000

In [21]:
WITH employee_ranking
AS (SELECT employee_id,
           last_name,
           first_name,
           salary,
           RANK() OVER (ORDER BY salary ASC) AS ranking
    FROM ##tmp1)
SELECT employee_id,
       last_name,
       first_name,
       salary
FROM employee_ranking
WHERE ranking <= 5
ORDER BY ranking

employee_id,last_name,first_name,salary
111,Graue,Juan,37000
101,Danner,Mary,80000
109,Danner,Ann,90000
106,Sanchez,Sue,110000
100,White,John,120000

In [2]:
WITH employee_ranking
AS (SELECT employee_id,
           last_name,
           first_name,
           salary,
           RANK() OVER (ORDER BY salary ASC) AS ranking
    FROM ##tmp1)
SELECT employee_id,
       last_name,
       first_name,
       salary
FROM employee_ranking
WHERE ranking = 2
ORDER BY ranking

employee_id,last_name,first_name,salary
101,Danner,Mary,80000

In [7]:
WITH employee_ranking
AS (SELECT employee_id,
           last_name,
           first_name,
           salary,
           dept_id,
           RANK() OVER (PARTITION BY dept_id ORDER BY salary DESC) AS ranking
    FROM ##tmp1)
SELECT dept_id,
       employee_id,
       last_name,
       first_name,
       salary
FROM employee_ranking
WHERE ranking = 2
ORDER BY dept_id,
         ranking

dept_id,employee_id,last_name,first_name,salary
Account,101,Danner,Mary,80000
IT,100,White,John,120000
Sales,102,Lynn,Ann,140000

- there is a SQL function called NTILE() which receives an integer parameter indicating the number of subsets into which we want to divide the entire result set.

In [8]:
WITH employee_ranking
AS (SELECT employee_id,
           last_name,
           first_name,
           salary,
           NTILE(2) OVER (ORDER BY salary) AS ntile
    FROM ##tmp1)
SELECT employee_id,
       last_name,
       first_name,
       salary
FROM employee_ranking
WHERE ntile = 1
ORDER BY salary

employee_id,last_name,first_name,salary
111,Graue,Juan,37000
101,Danner,Mary,80000
109,Danner,Ann,90000
106,Sanchez,Sue,110000
100,White,John,120000

In [9]:
WITH employee_ranking
AS (SELECT employee_id,
           last_name,
           first_name,
           salary,
           NTILE(4) OVER (ORDER BY salary) AS ntile
    FROM ##tmp1)
SELECT employee_id,
       last_name,
       first_name,
       salary
FROM employee_ranking
WHERE ntile = 4
ORDER BY salary

employee_id,last_name,first_name,salary
107,Doe,Marta,180000
110,Yang,Simon,250000

In [11]:
SELECT employee_id,
       last_name,
       first_name,
       salary,
       ROW_NUMBER() OVER (ORDER BY employee_id) AS ranking_position
FROM ##tmp1

employee_id,last_name,first_name,salary,ranking_position
100,White,John,120000,1
101,Danner,Mary,80000,2
102,Lynn,Ann,140000,3
103,O'connor,Peter,130000,4
106,Sanchez,Sue,110000,5
107,Doe,Marta,180000,6
109,Danner,Ann,90000,7
110,Yang,Simon,250000,8
111,Graue,Juan,37000,9